espressif/esp-idf/components/soc/esp32c6/include/soc/gdma_struct.h
/** Type of out_link_chn register
 *  Link descriptor configure and control register of Tx channel 0
 */
typedef union {
    struct {
        /** outlink_addr : R/W; bitpos: [19:0]; default: 0;
         *  This register stores the 20 least significant bits of the first outlink
         *  descriptor's address.
         */
        uint32_t outlink_addr:20;
        /** outlink_stop : WT; bitpos: [20]; default: 0;
         *  Set this bit to stop dealing with the outlink descriptors.
         */
        uint32_t outlink_stop:1;
        /** outlink_start : WT; bitpos: [21]; default: 0;
         *  Set this bit to start dealing with the outlink descriptors.
         */
        uint32_t outlink_start:1;
        /** outlink_restart : WT; bitpos: [22]; default: 0;
         *  Set this bit to restart a new outlink from the last address.
         */
        uint32_t outlink_restart:1;
        /** outlink_park : RO; bitpos: [23]; default: 1;
         *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
         *  is working.
         */
        uint32_t outlink_park:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} gdma_out_link_chn_reg_t;

/** Group: Version Registers */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 35660368;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} gdma_date_reg_t;


/** Group: Status Registers */
/** Type of infifo_status_chn register
 *  Receive FIFO status of Rx channel 0
 */
typedef union {
    struct {
        /** infifo_full : RO; bitpos: [0]; default: 1;
         *  L1 Rx FIFO full signal for Rx channel 0.
         */
        uint32_t infifo_full:1;
        /** infifo_empty : RO; bitpos: [1]; default: 1;
         *  L1 Rx FIFO empty signal for Rx channel 0.
         */
        uint32_t infifo_empty:1;
        /** infifo_cnt : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.
         */
        uint32_t infifo_cnt:6;
        uint32_t reserved_8:15;
        /** in_remain_under_1b : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_1b:1;
        /** in_remain_under_2b : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_2b:1;
        /** in_remain_under_3b : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_3b:1;
        /** in_remain_under_4b : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t in_remain_under_4b:1;
        /** in_buf_hungry : RO; bitpos: [27]; default: 0;
         *  reserved
         */
        uint32_t in_buf_hungry:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gdma_infifo_status_chn_reg_t;

/** Type of in_state_chn register
 *  Receive status of Rx channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_addr : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current inlink descriptor's address.
         */
        uint32_t inlink_dscr_addr:18;
        /** in_dscr_state : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state:2;
        /** in_state : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t in_state:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} gdma_in_state_chn_reg_t;

/** Type of in_suc_eof_des_addr_chn register
 *  Inlink descriptor address when EOF occurs of Rx channel 0
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr:32;
    };
    uint32_t val;
} gdma_in_suc_eof_des_addr_chn_reg_t;

/** Type of in_err_eof_des_addr_chn register
 *  Inlink descriptor address when errors occur of Rx channel 0
 */
typedef union {
    struct {
        /** in_err_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when there are some
         *  errors in current receiving data. Only used when peripheral is UHCI0.
         */
        uint32_t in_err_eof_des_addr:32;
    };
    uint32_t val;
} gdma_in_err_eof_des_addr_chn_reg_t;

/** Type of in_dscr_chn register
 *  Current inlink descriptor address of Rx channel 0
 */
typedef union {
    struct {
        /** inlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  The address of the current inlink descriptor x.
         */
        uint32_t inlink_dscr:32;
    };
    uint32_t val;
} gdma_in_dscr_chn_reg_t;

/** Type of in_dscr_bf0_chn register
 *  The last inlink descriptor address of Rx channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  The address of the last inlink descriptor x-1.
         */
        uint32_t inlink_dscr_bf0:32;
    };
    uint32_t val;
} gdma_in_dscr_bf0_chn_reg_t;

/** Type of in_dscr_bf1_chn register
 *  The second-to-last inlink descriptor address of Rx channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor x-2.
         */
        uint32_t inlink_dscr_bf1:32;
    };
    uint32_t val;
} gdma_in_dscr_bf1_chn_reg_t;

/** Type of outfifo_status_chn register
 *  Transmit FIFO status of Tx channel 0
 */
typedef union {
    struct {
        /** outfifo_full : RO; bitpos: [0]; default: 0;
         *  L1 Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full:1;
        /** outfifo_empty : RO; bitpos: [1]; default: 1;
         *  L1 Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty:1;
        /** outfifo_cnt : RO; bitpos: [7:2]; default: 0;
         *  The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt:6;
        uint32_t reserved_8:15;
        /** out_remain_under_1b : RO; bitpos: [23]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b:1;
        /** out_remain_under_2b : RO; bitpos: [24]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b:1;
        /** out_remain_under_3b : RO; bitpos: [25]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b:1;
        /** out_remain_under_4b : RO; bitpos: [26]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} gdma_outfifo_status_chn_reg_t;

/** Type of out_state_chn register
 *  Transmit status of Tx channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_addr : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr:18;
        /** out_dscr_state : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t out_dscr_state:2;
        /** out_state : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t out_state:3;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} gdma_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Outlink descriptor address when EOF occurs of Tx channel 0
 */
typedef union {
    struct {
        /** out_eof_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr:32;
    };
    uint32_t val;
} gdma_out_eof_des_addr_chn_reg_t;

/** Type of out_eof_bfr_des_addr_chn register
 *  The last outlink descriptor address when EOF occurs of Tx channel 0
 */
typedef union {
    struct {
        /** out_eof_bfr_des_addr : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor before the last outlink
         *  descriptor.
         */
        uint32_t out_eof_bfr_des_addr:32;
    };
    uint32_t val;
} gdma_out_eof_bfr_des_addr_chn_reg_t;

